In [10]:
import psycopg2
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine

In [11]:
user = 'postgres'
password = 'postgres'
host = 'localhost'
port = 5432  
dbname = 'EmployeeSQL'

engine = create_engine(f'postgres://{user}:{password}@{host}:{port}/{dbname}')
conn = engine.connect()

In [12]:
departments_data = pd.read_csv('data/departments.csv')
departments_data.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

In [28]:
dept_emp_data = pd.read_csv('data/dept_emp.csv')
dept_emp_data.head()
len(dept_emp_data)

331603

In [14]:
dept_manager_data = pd.read_csv('data/dept_manager.csv')
dept_manager_data.head()

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

In [15]:
employees_data = pd.read_csv('data/employees.csv')
employees_data['birth_date'] = pd.to_datetime(employees_data['birth_date'])
employees_data['hire_date'] = pd.to_datetime(employees_data['hire_date'])
employees_data.head()

   emp_no emp_title_id birth_date  first_name  last_name sex  hire_date
0  473302        s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053        e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444        e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786        s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238        e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

In [16]:
salaries_data = pd.read_csv('data/salaries.csv')
salaries_data.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [17]:
titles_data = pd.read_csv('data/titles.csv')
titles_data.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [18]:
#titles_data
titles_data.to_sql('titles', conn, if_exists = 'append', index = False)

In [19]:
#departments_data
departments_data.to_sql('departments', conn, if_exists = 'append', index = False)

In [20]:
#employees_data
employees_data.to_sql('employees', conn, if_exists = 'append', index = False)

In [21]:
#salaries_data
salaries_data.to_sql('salaries', conn, if_exists = 'append', index = False)

In [25]:
#dept_manager_data
dept_manager_data.to_sql('dept_manager', conn, if_exists = 'append', index = False)

In [24]:
dept_emp_data.head()
dept_emp_data.to_sql('dept_emp', conn, if_exists = 'append', index = False)